Autodesk.Revit.DB.Structure.RebarConstraint.ConstrainsRebarEnds
Returns true if this constraint constrains two rebar ends.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.GetPositiveOffsetDirectionForToOtherRebarConstraint
Returns the positive offset direction vector.
Remarks:
This is available only for constraints of type Autodesk.Revit.DB.Structure.RebarConstraintType.ToOtherRebar.
Valid  Autodesk.Revit.DB.Structure.TargetRebarConstraintType are:
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.RebarPlane
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.Edge
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.OutOfPlaneExtent
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.StartOfBar, only if the RebarShape has a definition of Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition with RebarShapeMultiplanarDefinition::IsStartConnectorPressent
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.EndOfBar, only if the RebarShape has a definition of Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition with RebarShapeMultiplanarDefinition::IsEndConnectorPressent
Returns:
The positive offset direction vector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The TargetRebarConstraintType is not valid.
Since:
2024

Autodesk.Revit.DB.Structure.RebarConstraint.FlipHandleOverTarget
Flips the RebarConstrainedHandle to the other side of the target bar handle, maintaining the distance in absolute value.
Remarks:
Throw exception if constraint type is not 'ToOtherRebar', or for constraints involving bar/hook bend handle.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.SetToUseClearBarSpacing(System.Boolean)
Sets whether the RebarConstrainedHandle to target offset is the clear bar distance, or is measured between bar centers.
Remarks:
Throw exception if it's used on start/end handle to start/end handle constraint, and on constraints involving bar/hook bend handle.
useClearBarSpacing:
True if the RebarConstrainedHandle to target offset is the clear bar distance, false if the offset is measured between bar centers.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarConstraint constrain two Rebar ends.
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.IsUsingClearBarSpacing
Returns true if the RebarConstrainedHandle to target offset is the clear bar distance, false if the offset is measured between bar centers.
Remarks:
Throw exception if it's used on start/end handle to start/end handle constraint, and on constraints involving bar/hook bend handle.
Returns:
Returns true if the RebarConstrainedHandle to target offset is the clear bar distance, false if the offset is measured between bar centers.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarConstraint constrain two Rebar ends.
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.SetToBindHandleWithTarget(System.Boolean)
Sets the relationship between two RebarConstrainedHandles.
Remarks:
Throws exception for any type of constraint other than 'ToOtherRebar' or if the RebarTargetConstraintType of the constraint is 'HookBend' or 'BarBend'.
Will also throw if the target Rebar has the 'Number with Spacing' layout rule and the RebarTargetConstraintType of the constraint is 'OutOfPlaneExtent'.
bindsHandleWithTarget:
False if only the constrained RebarConstrainedHandle follows the target. True if the constrained RebarConstrainedHandle and the target bar handle will be bound and move together.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
-or-
The RebarTargetConstraintType is 'OutOfPlaneExtent' and the rebar target layout is 'Number with Spacing'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.IsBindingHandleWithTarget
Gets the relationship between two RebarConstrainedHandles.
Remarks:
Throws exception for any type of constraint other than 'ToOtherRebar' or if the RebarTargetConstraintType of the constraint is 'HookBend' or 'BarBend'.
Will also throw if the target Rebar has the 'Number with Spacing' layout rule and the RebarTargetConstraintType of the constraint is 'OutOfPlaneExtent'.
Returns:
Returns False if only the constrained RebarConstrainedHandle follows the target. Returns True if the constrained RebarConstrainedHandle and the target bar handle are bound and move together.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
-or-
The RebarTargetConstraintType is 'OutOfPlaneExtent' and the rebar target layout is 'Number with Spacing'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.SetDistanceToTargetRebar(System.Double)
Sets the offset distance between the constrained RebarConstrainedHandle and its target Rebar handle surface.
Remarks:
Throws exception if the constraint is not to other rebar or if the target constraint is to bar bend or hook bend.
distanceToTargetRebar:
The distance is given as an offset value, the sign of which depends on the target bar handle direction.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for distanceToTargetRebar must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.GetDistanceToTargetRebar
Gets the distance from the RebarConstrainedHandle to the target Rebar handle surface.
The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar.'
Remarks:
Throws exception if the constraint is not to other rebar or if the target constraint is to bar bend or hook bend.
Returns:
Returns the distance from the RebarConstrainedHandle to the target Rebar handle surface.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.IsReferenceValidForConstraint(Autodesk.Revit.DB.Reference)
Checks if the reference provided can be used in creating Rebar constraints
Remarks:
Reference is valid if it points to an uncut face of a structural that can host rebar.
targetReference:
The reference to be checked
Returns:
returns true if reference can be used in a constraint, false otherwise
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019.1

Autodesk.Revit.DB.Structure.RebarConstraint.ReplaceReferenceTargets(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Boolean,System.Double)
Replaces the current set of references, the type of constraint and the offset value, with the newly provided ones.
Will throw exception if this is a constraint for Shape Driven Rebar.
handle:
The RebarConstrainedHandle that has this constraint.
targetReferences:
The references to which the rebar handle will be constrained.
This collection must contain one or more references to faces of elements that can host rebar.
isConstraintToCover:
If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue:
The distance from references to the rebar handle.
Throws Autodesk.Revit.Exceptions.ArgumentException:
handle is no longer valid.
-or-
targetReferences is empty.
-or-
targetReferences do not represent faces from structurals that can host rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Constrained rebar is a shape driven rebar element.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.Create(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Boolean,System.Double)
This method creates a constraint for a given Rebar Constrained Handle Tag.
Will throw exception if used for Shape Driven Rebar.
handle:
The handle of the rebar that will be constrained.
targetReferences:
The references to which the rebar handle will be constrained.
This collection must contain one or more references to faces of elements that can host rebar.
isConstraintToCover:
If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue:
The distance from references to the rebar handle.
Returns:
Returns the newly created RebarConstraint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Constrained rebar is a shape driven rebar element.
-or-
handle is no longer valid.
-or-
targetReferences is empty.
-or-
targetReferences do not represent faces from structurals that can host rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.IsEqual(Autodesk.Revit.DB.Structure.RebarConstraint)
Returns true if the specified RebarConstraint is the same as 'this.'  The method
can be used to determine which of the RebarConstraint candidates offered by the
RebarConstraintsManager is currently active.
Throws Autodesk.Revit.Exceptions.ArgumentException:
other is no longer valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.SetDistanceToTargetCover(System.Double)
Sets the distance from the RebarConstrainedHandle to the target Host Cover Element surface.
The RebarConstraintType of the RebarConstraint must be 'ToCover.'
distanceToTargetCover:
The distance is given as an offset value, the sign of which depends on Host Cover direction.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for distanceToTargetCover must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToCover.'
Since:
2016

Autodesk.Revit.DB.Structure.RebarConstraint.SetDistanceToTargetHostFace(System.Double)
Sets the distance from the RebarConstrainedHandle to the target Host Element surface.
The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace.'
offset:
The distance is given as an offset value, the sign of which depends on Host Face direction.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for offset must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace.'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetHostFaceAndTransform(System.Int32,Autodesk.Revit.DB.Transform)
Returns the face to which the RebarConstraint is attached associated to the given target index.
The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.'
targetIndex:
The index of the target. Should be between 0 and NumberOfTargets().
faceTransform:
Returns the transform that is associated to the face's element geometry.
Returns:
Requested Face.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetIndex is out of range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover.'
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.AreGeometryTargetsTheSame(Autodesk.Revit.DB.Structure.RebarConstraint)
Returns true if the gemetrical targets (ex. face references, other rebar segment references) of "this" constriant are the same as the targets of the "other" constraint.
Returns false otherwise.
Only the reference to the target piece of geometry is taken into account(ex. only face references, only other rebar segment references).
Target Element (elementId) is not taken into account.
Distance to target is not taken into account.
otherConstraint:
Returns the Element object (either Host or Rebar) which provides the constraint.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
Since:
2014